Перем _Значение;
Перем _Тип;

Процедура ПриРегистрации(ОпределениеАннотации) Экспорт
	
	Аннотация = РаботаСАннотациями.НайтиАннотацию(ОпределениеАннотации.Аннотации, "Завязь");
	Если _Значение <> "" Тогда
		Параметр = Аннотация.Параметры.Найти("Значение", "Имя");
		Если Параметр = Неопределено Тогда
			Параметр = Аннотация.Параметры.Добавить();
			Параметр.Имя = "Значение";
		КонецЕсли;
		Параметр.Значение = _Значение;
	КонецЕсли;

	Если _Тип <> "" Тогда
		Параметр = Аннотация.Параметры.Найти("Тип", "Имя");
		Если Параметр = Неопределено Тогда
			Параметр = Аннотация.Параметры.Добавить();
			Параметр.Имя = "Тип";
		КонецЕсли;
		Параметр.Значение = _Тип;
	КонецЕсли;
	
КонецПроцедуры

&Аннотация(Значение = "МетаЗавязь")
&Завязь
Процедура ПриСозданииОбъекта(
	&Параметр(ЗначениеПоУмолчанию = "") Значение,
	&Параметр(ЗначениеПоУмолчанию = "") Тип
)

	_Значение = Значение;
	_Тип = Тип;

КонецПроцедуры
