Перем _Значение;
Перем _Тип;

Процедура ПриРазворачиванииАннотации(ОпределениеАннотации) Экспорт
	
	Аннотация = РаботаСАннотациями.НайтиАннотацию(ОпределениеАннотации.Аннотации(), "Завязь");
	Если _Значение <> "" Тогда
		РаботаСАннотациями.УстановитьЗначениеПараметраАннотации(Аннотация, "Значение", _Значение);
	КонецЕсли;

	Если _Тип <> "" Тогда
		РаботаСАннотациями.УстановитьЗначениеПараметраАннотации(Аннотация, "Тип", _Тип);
	КонецЕсли;

КонецПроцедуры

&Аннотация(Значение = "МетаЗавязь")
&Завязь
Процедура ПриСозданииОбъекта(
	&Параметр(ЗначениеПоУмолчанию = "") Значение,
	&Параметр(ЗначениеПоУмолчанию = "") Тип
)

	_Значение = Значение;
	_Тип = Тип;

КонецПроцедуры
