
&Завязь(Значение = "Структура", Тип = "Структура")
Функция Структурочка() Экспорт
	Структура = Новый Структура();
	Структура.Вставить("Ключ", 0);

	Возврат Структура;
КонецФункции

&Завязь
Функция Массив(&Пластилин Структура) Экспорт
	Массив = Новый Массив();
	Массив.Добавить(Структура);

	Возврат Массив;
КонецФункции

&Завязь(Тип = "Число")
Функция ЗначениеСтруктуры(&Пластилин Структура) Экспорт
	Возврат Структура.Ключ;
КонецФункции

&Дуб
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры