#native

Перем _Рефлектор;

&Завязь
&Спецификация("Инициализация")
Функция КонтейнерАннотаций(&Пластилин Поделка) Экспорт
	КонтейнерАннотаций = _Рефлектор.ПолучитьСвойство(Поделка, "КонтейнерАннотаций");

	Возврат КонтейнерАннотаций;
КонецФункции

&Завязь
&Спецификация("Инициализация")
Функция РазворачивательАннотаций(&Пластилин Поделка) Экспорт
	// TODO: переделать на пластилин, когда можно будет внедрять пластилин в желуди инициализации
	КонтейнерАннотаций = _Рефлектор.ПолучитьСвойство(Поделка, "КонтейнерАннотаций");

	Возврат КонтейнерАннотаций.ПолучитьРазворачивательАннотаций();
КонецФункции

&Завязь
&Спецификация("Инициализация")
Функция ПрилепляторЧастиц(&Пластилин Поделка) Экспорт
	ПрилепляторЧастиц = _Рефлектор.ПолучитьСвойство(Поделка, "ПрилепляторЧастиц");

	Возврат ПрилепляторЧастиц;
КонецФункции

&Дуб
&Спецификация("Инициализация")
Процедура ПриСозданииОбъекта()
	_Рефлектор = Новый Рефлектор();
КонецПроцедуры
