#Использовать ".."
#Использовать asserts
#Использовать "./ТестКлассы"
#Использовать "./Заготовки"

&Пластилин
// Поделка - общая Поделка для тестов набора.
Перем Поделка;

&Тест
Процедура ПриЗапускеПриложенияОтрабатываетРогатка() Экспорт

	// Дано-Когда-Тогда
	Массив = Поделка.НайтиЖелудь("Массив");
	Ожидаем.Что(Массив).ИмеетДлину(5);

КонецПроцедуры

&Тест
Процедура ИнициализацияПоделкиСоСтороныПриложенияЧерезСтатическийИнициализатор() Экспорт

	// Дано-Когда-Тогда
	Желудь = Поделка.НайтиЖелудь("ЖелудьНижнегоУровня");
	Ожидаем.Что(Желудь).Не_().Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура ЗаготовкаРегистрируетПодчиненныеЖелуди() Экспорт

	// Дано-Когда-Тогда
	Желудь = Поделка.НайтиЖелудь("ЖелудьНижнегоУровня");
	Ожидаем.Что(Желудь).Не_().Равно(Неопределено);

КонецПроцедуры

&Тест
Процедура ВЗаготовкуМожноПрилепитьДетальку() Экспорт

	// Дано-Когда-Тогда
	Желудь = Поделка.НайтиЖелудь("ЗаготовкаСДеталькой");
	Ожидаем.Что(Желудь.ПростаяНастройка()).Равно("Значение простой настройки");

КонецПроцедуры

&Тест
&Изолированный
Процедура ВсеРогаткиЗапускаютсяКорректно() Экспорт

	// Дано-Когда-Тогда
	ДолгаяРогатка = Поделка.НайтиЖелудь("ДолгаяРогатка");
	Ожидаем.Что(ДолгаяРогатка.Значение).Равно(0);

	// Когда
	Приостановить(1500);

	// Тогда
	Ожидаем.Что(ДолгаяРогатка.Значение).Равно(1);

КонецПроцедуры
