#Использовать asserts
#Использовать "../src"

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/ЗаготовкаСПластилином")
Процедура ВЗаготовкуНельзяПрилепитьПластилин() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание)
			.Содержит("К желудю времени инициализации ЗаготовкаСПластилином можно прилеплять только детальки");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/ДваЖелудяСОднимИменем")
Процедура ДваЖелудяСОднимИменемКонфликтуют() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание)
			.Содержит("Определение желудя с именем ""ТестовыйЖелудь"" уже существует");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/ДваВерховныхЖелудя")
Процедура ДвухВерховныхЖелудейБытьНеМожет() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание)
			.Содержит("Определение верховного желудя с именем ""ТестовыйЖелудь"" уже существует");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/ДубСНекорректнойЗавязью")
Процедура ДубСНекорректнойЗавязью() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание)
			.Содержит("Тип желудя в Завязи КакойТоМетод класса ДубСНекорректнойЗавязью не известен");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/ПадающаяРогатка, ./ТестКлассы")
Процедура ПадениеРогаткиДолжноБытьЗалогировано() Экспорт  // BSLLS:Typo-off

	// Дано
	МокАппендера = Новый МокАппендера();
	Лог = Логирование.ПолучитьЛог("oscript.lib.autumn.ЗапускательПриложения");
	Лог.ДобавитьСпособВывода(МокАппендера, УровниЛога.Ошибка);

	Поделка = Новый Поделка;

	// Когда
	Поделка.ЗапуститьПриложение();
	Сообщения = МокАппендера.Сообщения;
	
	// Тогда
	Ожидаем.Что(Сообщения.Количество(), "Количество сообщений").Равно(1);
	Ожидаем.Что(Сообщения[0], "Сообщение об ошибке").Содержит("ОШИБКА - Ошибка запуска рогатки ПадающаяРогатка");
	
КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/АннотацияСПовторяемымиПараметрами")
Процедура ПовторениеНеповторяемыхПараметровКидаетИсключение() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание).Содержит("но параметр не помечен аннотацией ""Повторяемый""");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/НапильникБезИнтерфейса")
Процедура НапильникБезИнтерфейсаВызываетИсключение() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание).Содержит("Напильник должен иметь функцию ОбработатьЖелудь");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры

&Тест
&Изолированный(Уровень = "Процесс", Импорты = "./ОшибочныеКлассы/ЖелудьСНекорректнымХарактером")
Процедура ПроверкаНекорректногоХарактера() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание).Содержит("Неизвестный характер желудя");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры
