#Использовать ".."
#Использовать asserts
#Использовать "."

&Тест
Процедура ПроверкаПроизводительностиСозданияКомпанейскихЖелудей() Экспорт
	
	// Дано
	Поделка = Новый Поделка();
	Поделка
		.ДобавитьЖелудь(Тип("КомпанейскийЖелудь"))
		.ЗапуститьПриложение();
		
	
	КоличествоИтераций = 100000;
	ПорогПрохождения = 30;
	
	// Когда 
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Для _Н = 1 по КоличествоИтераций Цикл
		Желудь = Поделка.НайтиЖелудь("КомпанейскийЖелудь");
	КонецЦикла;
	
	Конец = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = (Конец - Начало) / 1000;

	// Тогда
	Ожидаем.Что(Результат, "Компанейские желуди создаются слишком долго").Меньше(ПорогПрохождения);

КонецПроцедуры