#Использовать asserts
#Использовать ".."

Перем Рефлектор; // Рефлектор

&Тест
Процедура ЗначенияДеталек_Получить() Экспорт

	// Дано

	ЗначенияДеталек = Новый Соответствие;
	ЗначенияДеталек.Вставить("Ключ", "Значение");

	СоветДругогоМастера = Новый СоветДругогоМастера();

	Рефлектор.УстановитьСвойство(СоветДругогоМастера, "ЗначенияДеталек", ЗначенияДеталек);

	// Когда

	Результат = СоветДругогоМастера.ЗначенияДеталек();

	// Тогда

	Ожидаем.Что(Результат).Равно(ЗначенияДеталек);

КонецПроцедуры

&Тест
Процедура ЗначенияДеталек_Установить() Экспорт

	// Дано

	ЗначенияДеталек = Новый Соответствие;
	ЗначенияДеталек.Вставить("Ключ", "Значение");

	СоветДругогоМастера = Новый СоветДругогоМастера();

	// Когда

	Результат = СоветДругогоМастера.ЗначенияДеталек(ЗначенияДеталек);

	// Тогда

	Ожидаем.Что(Результат).Равно(СоветДругогоМастера);
	Ожидаем.Что(Рефлектор.ПолучитьСвойство(СоветДругогоМастера, "ЗначенияДеталек")).Равно(ЗначенияДеталек);

КонецПроцедуры

&Тест
Процедура ПрефиксПеременныхСреды_Получить() Экспорт

	// Дано

	ПрефиксПеременныхСреды = "Тест";

	СоветДругогоМастера = Новый СоветДругогоМастера();

	Рефлектор.УстановитьСвойство(СоветДругогоМастера, "ПрефиксПеременныхСреды", ПрефиксПеременныхСреды);

	// Когда

	Результат = СоветДругогоМастера.ПрефиксПеременныхСреды();

	// Тогда

	Ожидаем.Что(Результат).Равно(ПрефиксПеременныхСреды);

КонецПроцедуры

&Тест
Процедура ПрефиксПеременныхСреды_Установить() Экспорт

	// Дано

	ПрефиксПеременныхСреды = "Тест";

	СоветДругогоМастера = Новый СоветДругогоМастера();

	// Когда

	Результат = СоветДругогоМастера.ПрефиксПеременныхСреды(ПрефиксПеременныхСреды);

	// Тогда

	Ожидаем.Что(Результат).Равно(СоветДругогоМастера);
	Ожидаем.Что(Рефлектор.ПолучитьСвойство(СоветДругогоМастера, "ПрефиксПеременныхСреды")).Равно(ПрефиксПеременныхСреды);

КонецПроцедуры

&Тест
Процедура ИмяФайлаСоЗначениямиДеталек_Получить() Экспорт

	// Дано

	ИмяФайлаСоЗначениямиДеталек = "/path/to/file";

	СоветДругогоМастера = Новый СоветДругогоМастера();

	Рефлектор.УстановитьСвойство(СоветДругогоМастера, "ИмяФайлаСоЗначениямиДеталек", ИмяФайлаСоЗначениямиДеталек);

	// Когда

	Результат = СоветДругогоМастера.ИмяФайлаСоЗначениямиДеталек();

	// Тогда

	Ожидаем.Что(Результат).Равно(ИмяФайлаСоЗначениямиДеталек);

КонецПроцедуры

&Тест
Процедура ИмяФайлаСоЗначениямиДеталек_Установить() Экспорт

	// Дано

	ИмяФайлаСоЗначениямиДеталек = "/path/to/file";

	СоветДругогоМастера = Новый СоветДругогоМастера();

	// Когда

	Результат = СоветДругогоМастера.ИмяФайлаСоЗначениямиДеталек(ИмяФайлаСоЗначениямиДеталек);

	// Тогда

	Ожидаем.Что(Результат).Равно(СоветДругогоМастера);
	Ожидаем.Что(Рефлектор.ПолучитьСвойство(СоветДругогоМастера, "ИмяФайлаСоЗначениямиДеталек"))
		.Равно(ИмяФайлаСоЗначениямиДеталек);

КонецПроцедуры

&Тест
Процедура ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек_Получить() Экспорт

	// Дано

	ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек = "/path/to/dir";

	СоветДругогоМастера = Новый СоветДругогоМастера();

	Рефлектор.УстановитьСвойство(
		СоветДругогоМастера,
		"ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек",
		ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек
	);

	// Когда

	Результат = СоветДругогоМастера.ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек();

	// Тогда

	Ожидаем.Что(Результат).Равно(ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек);

КонецПроцедуры

&Тест
Процедура ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек_Установить() Экспорт

	// Дано

	ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек = "/path/to/dir";

	СоветДругогоМастера = Новый СоветДругогоМастера();

	// Когда

	Результат = СоветДругогоМастера.ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек(
		ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек
	);

	// Тогда

	Ожидаем.Что(Результат).Равно(СоветДругогоМастера);
	Ожидаем.Что(Рефлектор.ПолучитьСвойство(СоветДругогоМастера, "ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек"))
		.Равно(ДополнительныйКаталогПоискаФайлаСоЗначениямиДеталек);

КонецПроцедуры

Рефлектор = Новый Рефлектор();
