#Использовать asserts

// Тест проверяет, что НапильникМенеджер корректно обрабатывает напильники
Процедура ТестНапильникМенеджер() Экспорт
	
	// Дано
	Поделка = Новый Поделка();
	
	// Когда 
	Поделка.ДобавитьТип(Тип("НапильникПрименяющийсяТолькоНаКонкретномЖелуде"), Ложь);
	Поделка.ДобавитьТип(Тип("КомпанейскийЖелудь"), Ложь);
	
	Напильник = Поделка.НайтиЖелудь("НапильникПрименяющийсяТолькоНаКонкретномЖелуде");
	Желудь = Поделка.НайтиЖелудь("КомпанейскийЖелудь");
	
	// Тогда
	Ожидаем.Что(Напильник.СработалоРаз).Равно(1);
	
КонецПроцедуры

// Тест проверяет, что ПриемкаЗависимостей корректно подготавливает прилепляемые частицы
Процедура ТестПриемкаЗависимостей() Экспорт
	
	// Дано
	Поделка = Новый Поделка();
	
	// Когда
	Поделка.ДобавитьТип(Тип("ЖелудьСБлестяшкой"), Ложь);
	
	Желудь = Поделка.НайтиЖелудь("ЖелудьСБлестяшкой", Новый Массив);
	
	// Тогда
	Ожидаем.Что(Желудь).НеРавно(Неопределено);
	
КонецПроцедуры