// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedParameters-off
Перем Имя;

Процедура ПриРазворачиванииАннотации(ОпределениеАннотации, ПодчиненныеАннотации, ТипВладельцаСвойств, Свойство) Экспорт

	Аннотация = РаботаСАннотациями.НайтиАннотацию(ПодчиненныеАннотации, "Прозвище");
	РаботаСАннотациями.УстановитьЗначениеПараметраАннотации(Аннотация, "Значение", Имя);

КонецПроцедуры

&Аннотация("МетаПрозвище")
&Прозвище(Значение = "")
Процедура ПриСозданииОбъекта(Значение)
	Имя = Значение;
КонецПроцедуры
