// BSLLS:MissingVariablesDescription-off
// BSLLS:UnusedParameters-off
Перем _Значение;
Перем _Тип;

Процедура ПриРазворачиванииАннотации(ОпределениеАннотации, ПодчиненныеАннотации, ТипВладельцаСвойств, Свойство) Экспорт
	
	Аннотация = РаботаСАннотациями.НайтиАннотацию(ПодчиненныеАннотации, "Завязь");
	Если _Значение <> "" Тогда
		РаботаСАннотациями.УстановитьЗначениеПараметраАннотации(Аннотация, "Значение", _Значение);
	КонецЕсли;

	Если _Тип <> "" Тогда
		РаботаСАннотациями.УстановитьЗначениеПараметраАннотации(Аннотация, "Тип", _Тип);
	КонецЕсли;

КонецПроцедуры

&Аннотация(Значение = "МетаЗавязь")
&Завязь
Процедура ПриСозданииОбъекта(Значение = "", Тип = "")

	_Значение = Значение;
	_Тип = Тип;

КонецПроцедуры
