// BSLLS:ExportVariables-off
// BSLLS:MissingVariablesDescription-off
Перем _ЖелудьНижнегоУровня;

&Пластилин("ЖелудьНижнегоУровня")
Перем ВнедряемыйЖелудьНижнегоУровня Экспорт;

&Пластилин(Значение = "Кругляш", Тип = "Массив")
Перем ВнедряемыеЖелудиПоПрозвищу Экспорт;

Перем ВнедряемыйЖелудьНижнегоУровняЧерезСеттер;

Перем ВнедряемыйЖелудьНижнегоУровняЧерезСеттерСоСтраннымИменем;

Перем ПеременнаяВИнит;

&Пластилин("ЖелудьНижнегоУровня")
Перем ПриватныйЖелудь;

Функция ПолучитьПриватныйЖелудь() Экспорт
	Возврат ПриватныйЖелудь;
КонецФункции

Функция ЖелудьНижнегоУровня() Экспорт
	Возврат _ЖелудьНижнегоУровня;
КонецФункции

Функция	ВнедряемыйЖелудьНижнегоУровня() Экспорт
	Возврат ВнедряемыйЖелудьНижнегоУровня;
КонецФункции

Функция	ВнедряемыйЖелудьНижнегоУровняЧерезСеттер() Экспорт
	Возврат ВнедряемыйЖелудьНижнегоУровняЧерезСеттер;
КонецФункции

Функция	ВнедряемыйЖелудьНижнегоУровняЧерезСеттерСоСтраннымИменем() Экспорт
	Возврат ВнедряемыйЖелудьНижнегоУровняЧерезСеттерСоСтраннымИменем;
КонецФункции

Функция ПеременнаяВИнит() Экспорт
	Возврат ПеременнаяВИнит;
КонецФункции

&Пластилин
Процедура УстановитьЖелудьНижнегоУровня(Значение) Экспорт
	ВнедряемыйЖелудьНижнегоУровняЧерезСеттер = Значение;
КонецПроцедуры

&Пластилин("ЖелудьНижнегоУровня")
Процедура УстановитьЖелудьНижнегоУровняСоСтраннымИменемСеттера(Значение) Экспорт
	ВнедряемыйЖелудьНижнегоУровняЧерезСеттерСоСтраннымИменем = Значение;
КонецПроцедуры

&ФинальныйШтрих
Процедура Инит() Экспорт
	ПеременнаяВИнит = 1;
КонецПроцедуры

&Желудь
Процедура ПриСозданииОбъекта(
	&Пластилин ЖелудьНижнегоУровня
)
	_ЖелудьНижнегоУровня = ЖелудьНижнегоУровня;
КонецПроцедуры