
&Завязь(Значение = "Структура", Тип = "Структура")
Функция Структурочка() Экспорт
	Структура = Новый Структура();
	Структура.Вставить("Ключ", 0);

	Возврат Структура;
КонецФункции

&Завязь
Функция Массив(&Пластилин Структура) Экспорт
	Массив = Новый Массив();
	Массив.Добавить(Структура);

	Возврат Массив;
КонецФункции

&Завязь(Тип = "Число")
Функция ЗначениеСтруктуры(&Пластилин Структура) Экспорт
	Возврат Структура.Ключ;
КонецФункции

&МетаЗавязь(Значение = "МетаМассив", Тип = "Массив")
Функция МетаМассив() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(1);

	Возврат Массив;
КонецФункции

&МетаЗавязь(Значение = "ВторойМетаМассив", Тип = "Массив")
Функция МетаВторойМетаМассив() Экспорт
	Массив = Новый Массив;
	Массив.Добавить(1);

	Возврат Массив;
КонецФункции

&Дуб
Процедура ПриСозданииОбъекта()
	
КонецПроцедуры