&Завязь(Тип = "Число")
&Прозвище("ЧислоСБлестяшками")
Функция ВнедренноеСложноеЧисло(&Пластилин(Блестяшка = 1, Блестяшка = 2) СложноеЧисло) Экспорт
	Возврат СложноеЧисло;
КонецФункции

&Завязь(Тип = "Число")
&Прозвище("ЧислоСБлестяшками")
Функция ВтороеВнедренноеСложноеЧисло(&Пластилин(Блестяшка = 1, Блестяшка = 2) СложноеЧисло) Экспорт
	Возврат СложноеЧисло;
КонецФункции

&Завязь(Тип = "Число")
Функция СложноеЧисло(&Блестяшка Параметр1, &Блестяшка Параметр2) Экспорт
	Возврат Параметр1 + Параметр2;
КонецФункции

&Дуб
Процедура ПриСозданииОбъекта()

КонецПроцедуры
