Перем _ЖелудьПоУсловию;

Функция ЖелудьПоУсловию() Экспорт
	Возврат _ЖелудьПоУсловию;
КонецФункции

// Дуб с завязью, на которой стоит условие
&Дуб
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&УсловиеНаСвойство("Фича1.Включена")
&Завязь(Тип = "Строка")
Функция ЖелудьИзЗавязиСУсловиемИстина() Экспорт
	Возврат "ЖелудьИзЗавязиСУсловиемИстина";
КонецФункции

&УсловиеНаСвойство("Фича2.Включена")
&Завязь(Тип = "Строка")
Функция ЖелудьИзЗавязиСУсловиемЛожь() Экспорт
	Возврат "ЖелудьИзЗавязиСУсловиемЛожь";
КонецФункции
