#Использовать "../../.."
#Использовать "../../../tests/ТестКлассы"

// Бенчмарк инициализации поделки.
//
// Настройки запуска задаются в наборе тестов производительности: инициализация
// поделки - тяжелая операция, автоподбор количества вызовов за итерацию для нее
// не нужен.

#Область Бенчмарки

// Создает и запускает поделку со всеми тестовыми желудями.
&Бенчмарк(Наименование = "Инициализация поделки")
Процедура ИнициализацияПоделки() Экспорт

	Поделка = Новый Поделка();
	Поделка.ЗапуститьПриложение();

КонецПроцедуры

#КонецОбласти
