#Использовать asserts
#Использовать "../../src"
#Использовать "../ОшибочныеКлассы/ЗаготовкаСПластилином"

&Тест
Процедура ВЗаготовкуНельзяПрилепитьПластилин() Экспорт

	БылаОшибка = Ложь;

	Попытка
		Поделка = Новый Поделка(); // BSLLS:UnusedLocalVariable-off
	Исключение
		БылаОшибка = Истина;
		Ожидаем.Что(ИнформацияОбОшибке().Описание)
			.Содержит("К желудю времени инициализации ЗаготовкаСПластилином можно прилеплять только детальки");
	КонецПопытки;

	Ожидаем.Что(БылаОшибка).ЭтоИстина();

КонецПроцедуры
