#Использовать asserts
#Использовать "../../src"
#Использовать "../ТестКлассы"
#Использовать "../ОшибочныеКлассы/ПадающаяРогатка"

&Тест
Процедура ПадениеРогаткиДолжноБытьЗалоггировано() Экспорт

	// Дано
	МокАппендера = Новый МокАппендера();
	Лог = Логирование.ПолучитьЛог("oscript.lib.autumn.ЗапускательПриложения");
	Лог.ДобавитьСпособВывода(МокАппендера, УровниЛога.Ошибка);

	Поделка = Новый Поделка;

	// Когда
	Поделка.ЗапуститьПриложение();
	Сообщения = МокАппендера.Сообщения;
	
	// Тогда
	Ожидаем.Что(Сообщения.Количество(), "Количество сообщений").Равно(1);
	Ожидаем.Что(Сообщения[0], "Сообщение об ошибке").Содержит("ОШИБКА - Ошибка запуска рогатки ПадающаяРогатка");
	
КонецПроцедуры
