#Использовать logos

#Область ОписаниеПеременных

// Список заготовок для запуска при инициализации поделки.
Перем Заготовки;

// Логгер.
Перем Лог;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Служебный.
//
// Возвращаемое значение:
//   Массив - список заготовок для автоматической инициализации.
//
Функция ПолучитьЗаготовкиДляАвтоИнициализации() Экспорт
	Возврат Новый ФиксированныйМассив(Заготовки);
КонецФункции

#КонецОбласти

#Область Инициализация

Заготовки = Новый Массив;
Лог = Логирование.ПолучитьЛог("oscript.lib.autumn.static-initializer");

#КонецОбласти
