#native

Перем Значения;

// Состояние инициализации приложения: идёт настройка контекста и регистрация желудей.
//
//  Возвращаемое значение:
//   Строка
//
Функция Инициализация() Экспорт
	Возврат "Инициализация";
КонецФункции

// Состояние выполнения приложения: контекст настроен, желуди создаются и используются.
//
//  Возвращаемое значение:
//   Строка
//
Функция Выполнение() Экспорт
	Возврат "Выполнение";
КонецФункции

// Возвращает список всех возможных состояний приложения.
//
//  Возвращаемое значение:
//   ФиксированныйМассив из Строка
//
Функция Значения() Экспорт
	Возврат Значения;
КонецФункции

Значения = Новый Массив;
	
Значения.Добавить(Инициализация());
Значения.Добавить(Выполнение());

Значения = Новый ФиксированныйМассив(Значения);
