// Согласует создание одноименных одиночек в двух поделках.

Перем Блокировка;
Перем ПерваяНачалаСоздание;
Перем ВтораяСоздана;

// Отмечает начало создания одиночки.
//
//  Возвращаемое значение:
//   Булево - Истина, если одиночка создается первой.
//
Функция НачатьСоздание() Экспорт

	Блокировка.Заблокировать();
	ЭтоПервая = НЕ ПерваяНачалаСоздание;
	ПерваяНачалаСоздание = Истина;
	Блокировка.Разблокировать();

	Возврат ЭтоПервая;

КонецФункции

// Отмечает, что вторая одиночка создана.
//
Процедура ОтметитьСозданиеВторой() Экспорт
	ВтораяСоздана = Истина;
КонецПроцедуры

// Ждет создания второй одиночки.
//
// Параметры:
//   Таймаут - Число - Максимальное время ожидания в миллисекундах.
//
//  Возвращаемое значение:
//   Булево - Истина, если вторая одиночка создана до истечения таймаута.
//
Функция ДождатьсяВторой(Таймаут) Экспорт

	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Пока НЕ ВтораяСоздана И ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало < Таймаут Цикл
		Приостановить(10);
	КонецЦикла;

	Возврат ВтораяСоздана;

КонецФункции

Блокировка = Новый БлокировкаРесурса();
ПерваяНачалаСоздание = Ложь;
ВтораяСоздана = Ложь;
