#Использовать ".."
#Использовать "../tests/ТестКлассы"

Перем _Поделка;             // Поделка
Перем _ЖелудьСТабакеркой;   // ЖелудьСКомпанейскойТабакеркой

#Область ОбработчикиСобытий

// Создает бенчмарк создания желудей.
&КоличествоИтераций(10)
&КоличествоПрогревочныхИтераций(3)
&МинимальноеВремяИтерации(100)
&СортировкаОтБыстрыхКМедленным
Процедура ПриСозданииОбъекта()
КонецПроцедуры

// Готовит запущенную поделку и желудь с табакеркой до начала замеров.
&ПередКаждымКейсом
Процедура ПодготовитьПоделку(Контекст) Экспорт

	_Поделка = Новый Поделка();
	_Поделка.ЗапуститьПриложение();

	_ЖелудьСТабакеркой = _Поделка.НайтиЖелудь("ЖелудьСКомпанейскойТабакеркой");

КонецПроцедуры

#КонецОбласти

#Область Бенчмарки

// Создает компанейский желудь без зависимостей.
&Бенчмарк(Наименование = "Создание компанейского желудя")
&Эталон
Процедура СозданиеКомпанейскогоЖелудя() Экспорт
	_Поделка.НайтиЖелудь("КомпанейскийЖелудь");
КонецПроцедуры

// Достает компанейский желудь из табакерки.
&Бенчмарк(Наименование = "Создание компанейского желудя из табакерки")
Процедура СозданиеКомпанейскогоЖелудяИзТабакерки() Экспорт
	_ЖелудьСТабакеркой.КомпанейскийЖелудь.Достать();
КонецПроцедуры

// Создает компанейский желудь с пластилином на полях.
&Бенчмарк(Наименование = "Создание компанейского желудя с пластилином на полях")
Процедура СозданиеКомпанейскогоЖелудяСПластилиномНаПолях() Экспорт
	_Поделка.НайтиЖелудь("КомпанейскийЖелудьСПластилиномНаПолях");
КонецПроцедуры

// Создает компанейский желудь с пластилином в конструкторе.
&Бенчмарк(Наименование = "Создание компанейского желудя с пластилином в конструкторе")
Процедура СозданиеКомпанейскогоЖелудяСПластилиномВКонструкторе() Экспорт
	_Поделка.НайтиЖелудь("КомпанейскийЖелудьСПластилиномВКонструкторе");
КонецПроцедуры

#КонецОбласти
